{"class_name": "Model", "config": {"name": "model", "layers": [{"name": "question_base", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 30], "dtype": "int32", "sparse": false, "name": "question_base"}, "inbound_nodes": []}, {"name": "answer_good_base", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 30], "dtype": "int32", "sparse": false, "name": "answer_good_base"}, "inbound_nodes": []}, {"name": "answer_bad_base", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 30], "dtype": "int32", "sparse": false, "name": "answer_bad_base"}, "inbound_nodes": []}, {"name": "lstm_convolution_model", "class_name": "Model", "config": {"name": "lstm_convolution_model", "layers": [{"name": "question_base", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 30], "dtype": "int32", "sparse": false, "name": "question_base"}, "inbound_nodes": []}, {"name": "answer_good_base", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 30], "dtype": "int32", "sparse": false, "name": "answer_good_base"}, "inbound_nodes": []}, {"name": "embedding_1", "class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 8171, "output_dim": 100, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["question_base", 0, 0, {}]], [["answer_good_base", 0, 0, {}]]]}, {"name": "lstm_1", "class_name": "LSTM", "config": {"name": "lstm_1", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 10, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}, "inbound_nodes": [[["embedding_1", 0, 0, {}]], [["embedding_1", 1, 0, {}]]]}, {"name": "lstm_2", "class_name": "LSTM", "config": {"name": "lstm_2", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 10, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1}, "inbound_nodes": [[["embedding_1", 0, 0, {}]], [["embedding_1", 1, 0, {}]]]}, {"name": "concatenate_1", "class_name": "Concatenate", "config": {"name": "concatenate_1", "trainable": true, "axis": -1}, "inbound_nodes": [[["lstm_1", 0, 0, {}], ["lstm_2", 0, 0, {}]]]}, {"name": "concatenate_2", "class_name": "Concatenate", "config": {"name": "concatenate_2", "trainable": true, "axis": -1}, "inbound_nodes": [[["lstm_1", 1, 0, {}], ["lstm_2", 1, 0, {}]]]}, {"name": "conv1d_1", "class_name": "Conv1D", "config": {"name": "conv1d_1", "trainable": true, "filters": 1, "kernel_size": [20], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]], [["concatenate_2", 0, 0, {}]]]}, {"name": "lambda_1", "class_name": "Lambda", "config": {"name": "lambda_1", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAABTAAAAcxAAAAB0AGoBfABkAWQCZAONA1MAKQRO6QEAAABGKQLaBGF4\naXPaCGtlZXBkaW1zKQLaAUvaA21heCkB2gF4qQByBwAAAPpBL2hvbWUvbWFyY2Vsby9tYWNoaW5l\nLWxlYXJuaW5nL1F1ZXN0aW9uLUFuc3dlci1TZWxlY3Rpb24vbW9kZWwucHnaCDxsYW1iZGE+lAAA\nAPMAAAAA\n", null, null], "function_type": "lambda", "output_shape": ["4wEAAAAAAAAAAQAAAAMAAABTAAAAcxAAAAB8AGQBGQB8AGQCGQBmAlMAKQNO6QAAAADpAgAAAKkA\nKQHaAXhyAwAAAHIDAAAA+kEvaG9tZS9tYXJjZWxvL21hY2hpbmUtbGVhcm5pbmcvUXVlc3Rpb24t\nQW5zd2VyLVNlbGVjdGlvbi9tb2RlbC5wedoIPGxhbWJkYT6UAAAA8wAAAAA=\n", null, null], "output_shape_type": "lambda", "arguments": {}}, "inbound_nodes": [[["conv1d_1", 0, 0, {}]], [["conv1d_1", 1, 0, {}]]]}, {"name": "dot_1", "class_name": "Dot", "config": {"name": "dot_1", "trainable": true, "axes": -1, "normalize": true}, "inbound_nodes": [[["lambda_1", 0, 0, {}], ["lambda_1", 1, 0, {}]]]}], "input_layers": [["question_base", 0, 0], ["answer_good_base", 0, 0]], "output_layers": [["dot_1", 0, 0]]}, "inbound_nodes": [[["question_base", 0, 0, {}], ["answer_good_base", 0, 0, {}]], [["question_base", 0, 0, {}], ["answer_bad_base", 0, 0, {}]]]}, {"name": "lambda_2", "class_name": "Lambda", "config": {"name": "lambda_2", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAQAAAATAAAAcxoAAAB0AGoBiAB8AGQBGQAYAHwAZAIZABcAgwFTACkDTukA\nAAAA6QEAAAApAtoBS9oEcmVsdSkB2gF4KQHaBm1hcmdpbqkA+kEvaG9tZS9tYXJjZWxvL21hY2hp\nbmUtbGVhcm5pbmcvUXVlc3Rpb24tQW5zd2VyLVNlbGVjdGlvbi9tb2RlbC5wedoIPGxhbWJkYT6s\nAAAA8wAAAAA=\n", null, [0.05]], "function_type": "lambda", "output_shape": ["4wEAAAAAAAAAAQAAAAIAAABTAAAAcwgAAAB8AGQBGQBTACkCTukAAAAAqQApAdoBeHICAAAAcgIA\nAAD6QS9ob21lL21hcmNlbG8vbWFjaGluZS1sZWFybmluZy9RdWVzdGlvbi1BbnN3ZXItU2VsZWN0\naW9uL21vZGVsLnB52gg8bGFtYmRhPqwAAADzAAAAAA==\n", null, null], "output_shape_type": "lambda", "arguments": {}}, "inbound_nodes": [[["lstm_convolution_model", 1, 0, {}], ["lstm_convolution_model", 2, 0, {}]]]}], "input_layers": [["question_base", 0, 0], ["answer_good_base", 0, 0], ["answer_bad_base", 0, 0]], "output_layers": [["lambda_2", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}